{
    "text": "Long ago, in a small village in Japan, an old man and woman lived together by the mountains. The man went out every day to cut grass and gather firewood, while the woman stayed home to wash clothes and cook meals. Though they were kind and hardworking, they had no children, and this made them very sad. One day, while the old woman was washing clothes at the river, she saw something round and pink floating toward her. It was a giant peach, bigger than any she had ever seen! She pulled it from the water and brought it home to show her husband. “Look what I found!” she said. “This peach is enormous! Let’s eat it together.” The old man agreed, and as he took out his knife to cut it open, the peach suddenly split in half by itself. Inside, instead of a pit, there was a baby boy, healthy and smiling. The couple was overjoyed. “This must be a gift from the heavens!” the old woman cried. They named the boy Momotaro, which means “Peach Boy,” because he had come from a peach. They raised him with love, feeding him rice, fish, and vegetables from their garden. Momotaro grew up strong, brave, and kind. Years passed, and Momotaro became a young man. One day, he heard terrible news—a band of oni (ogres) had been attacking villages on a distant island, stealing food, treasure, and even kidnapping people. The villagers were afraid, and no one dared to stand up to the oni. Momotaro went to his parents and said, “I must go to Oni Island and defeat these monsters.” The old man and woman were worried, but they knew their son was brave. His mother prepared special kibi dango (millet dumplings) for his journey, and his father gave him a sword and a banner with his name written on it. “Be careful,” they said as they waved goodbye. Momotaro set off down the road, determined to reach the coast where he could find a boat to Oni Island. As he walked, he met a dog with sharp teeth, who barked at him. “Where are you going, boy?” the dog asked. “I’m going to Oni Island to defeat the oni,” Momotaro replied."
}